Revit 2026 API

# DocumentNewRoomTag Method

---

Creates a new RoomTag referencing a room in the host model or in a Revit link.

**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public RoomTag NewRoomTag(
	LinkElementId roomId,
	UV point,
	ElementId viewId
)
```
```vb
Public Function NewRoomTag (
	roomId As LinkElementId,
	point As UV,
	viewId As ElementId
) As RoomTag
```
```cpp
public:
RoomTag^ NewRoomTag(
	LinkElementId^ roomId,
	UV^ point,
	ElementId^ viewId
)
```
```fsharp
member NewRoomTag :
        roomId : LinkElementId *
        point : UV *
        viewId : ElementId -> RoomTag
```

#### Parameters

roomId LinkElementId
     The HostOrLinkElementId of the Room.
point UV
     A 2D point that defines the tag location on the level of the room.
viewId ElementId
     The id of the view where the tag will be shown. If  and the room in not in a Revit link, the view of the room will be used.

#### Return Value

RoomTag If successful a RoomTag object will be returned, otherwise .

| Exception | Condition |
| --- | --- |
| ArgumentException | viewId is not associated with a plan view or section view. |
| InvalidOperationException | viewId is null and the room is in a linked file. |

#### Reference

Document Class

Autodesk.Revit.Creation Namespace